Microchip-MPLAB-Harmony/touch_apps/apps/qt7_selfcap_xpro_board/pic32cm_pl10_cnano/firmware/src/packs/PIC32CM6408PL10048_DFP/component/sercom.h
#define SERCOM_SPI_CTRLB_CHSIZE_Pos           _UINT32_(0)                                          /* (SERCOM_SPI_CTRLB) Character Size Position */
#define SERCOM_SPI_CTRLB_CHSIZE_Msk           (_UINT32_(0x7) << SERCOM_SPI_CTRLB_CHSIZE_Pos)       /* (SERCOM_SPI_CTRLB) Character Size Mask */
#define SERCOM_SPI_CTRLB_CHSIZE(value)        (SERCOM_SPI_CTRLB_CHSIZE_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLB_CHSIZE_Pos)) /* Assignment of value for CHSIZE in the SERCOM_SPI_CTRLB register */
#define   SERCOM_SPI_CTRLB_CHSIZE_8_BIT_Val   _UINT32_(0x0)                                        /* (SERCOM_SPI_CTRLB) Eight bits  */
#define   SERCOM_SPI_CTRLB_CHSIZE_9_BIT_Val   _UINT32_(0x1)                                        /* (SERCOM_SPI_CTRLB) Nine bits  */
#define SERCOM_SPI_CTRLB_CHSIZE_8_BIT         (SERCOM_SPI_CTRLB_CHSIZE_8_BIT_Val << SERCOM_SPI_CTRLB_CHSIZE_Pos) /* (SERCOM_SPI_CTRLB) Eight bits Position */
#define SERCOM_SPI_CTRLB_CHSIZE_9_BIT         (SERCOM_SPI_CTRLB_CHSIZE_9_BIT_Val << SERCOM_SPI_CTRLB_CHSIZE_Pos) /* (SERCOM_SPI_CTRLB) Nine bits Position */
#define SERCOM_SPI_CTRLB_PLOADEN_Pos          _UINT32_(6)                                          /* (SERCOM_SPI_CTRLB) Client Data Preload Enable Position */
#define SERCOM_SPI_CTRLB_PLOADEN_Msk          (_UINT32_(0x1) << SERCOM_SPI_CTRLB_PLOADEN_Pos)      /* (SERCOM_SPI_CTRLB) Client Data Preload Enable Mask */
#define SERCOM_SPI_CTRLB_PLOADEN(value)       (SERCOM_SPI_CTRLB_PLOADEN_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLB_PLOADEN_Pos)) /* Assignment of value for PLOADEN in the SERCOM_SPI_CTRLB register */
#define SERCOM_SPI_CTRLB_SSDE_Pos             _UINT32_(9)                                          /* (SERCOM_SPI_CTRLB) SPI Select Low Detect Enable Position */
#define SERCOM_SPI_CTRLB_SSDE_Msk             (_UINT32_(0x1) << SERCOM_SPI_CTRLB_SSDE_Pos)         /* (SERCOM_SPI_CTRLB) SPI Select Low Detect Enable Mask */
#define SERCOM_SPI_CTRLB_SSDE(value)          (SERCOM_SPI_CTRLB_SSDE_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLB_SSDE_Pos)) /* Assignment of value for SSDE in the SERCOM_SPI_CTRLB register */
#define SERCOM_SPI_CTRLB_MSSEN_Pos            _UINT32_(13)                                         /* (SERCOM_SPI_CTRLB) Host SPI Select Enable Position */
#define SERCOM_SPI_CTRLB_MSSEN_Msk            (_UINT32_(0x1) << SERCOM_SPI_CTRLB_MSSEN_Pos)        /* (SERCOM_SPI_CTRLB) Host SPI Select Enable Mask */
#define SERCOM_SPI_CTRLB_MSSEN(value)         (SERCOM_SPI_CTRLB_MSSEN_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLB_MSSEN_Pos)) /* Assignment of value for MSSEN in the SERCOM_SPI_CTRLB register */
#define SERCOM_SPI_CTRLB_AMODE_Pos            _UINT32_(14)                                         /* (SERCOM_SPI_CTRLB) Address Mode Position */
#define SERCOM_SPI_CTRLB_AMODE_Msk            (_UINT32_(0x3) << SERCOM_SPI_CTRLB_AMODE_Pos)        /* (SERCOM_SPI_CTRLB) Address Mode Mask */
#define SERCOM_SPI_CTRLB_AMODE(value)         (SERCOM_SPI_CTRLB_AMODE_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLB_AMODE_Pos)) /* Assignment of value for AMODE in the SERCOM_SPI_CTRLB register */
#define   SERCOM_SPI_CTRLB_AMODE_MASK_Val     _UINT32_(0x0)                                        /* (SERCOM_SPI_CTRLB) ADDRMASK is used as a mask to the ADDR register  */
#define   SERCOM_SPI_CTRLB_AMODE_2ADDRS_Val   _UINT32_(0x1)                                        /* (SERCOM_SPI_CTRLB) The client responds to the two unique addresses in ADDR and ADDRMASK  */
#define   SERCOM_SPI_CTRLB_AMODE_RANGE_Val    _UINT32_(0x2)                                        /* (SERCOM_SPI_CTRLB) The client responds to the range of addresses between and including ADDR and ADDRMASK with ADDR as the upper limit  */
#define SERCOM_SPI_CTRLB_AMODE_MASK           (SERCOM_SPI_CTRLB_AMODE_MASK_Val << SERCOM_SPI_CTRLB_AMODE_Pos) /* (SERCOM_SPI_CTRLB) ADDRMASK is used as a mask to the ADDR register Position */
#define SERCOM_SPI_CTRLB_AMODE_2ADDRS         (SERCOM_SPI_CTRLB_AMODE_2ADDRS_Val << SERCOM_SPI_CTRLB_AMODE_Pos) /* (SERCOM_SPI_CTRLB) The client responds to the two unique addresses in ADDR and ADDRMASK Position */
#define SERCOM_SPI_CTRLB_AMODE_RANGE          (SERCOM_SPI_CTRLB_AMODE_RANGE_Val << SERCOM_SPI_CTRLB_AMODE_Pos) /* (SERCOM_SPI_CTRLB) The client responds to the range of addresses between and including ADDR and ADDRMASK with ADDR as the upper limit Position */
#define SERCOM_SPI_CTRLB_RXEN_Pos             _UINT32_(17)                                         /* (SERCOM_SPI_CTRLB) Receiver Enable Position */
#define SERCOM_SPI_CTRLB_RXEN_Msk             (_UINT32_(0x1) << SERCOM_SPI_CTRLB_RXEN_Pos)         /* (SERCOM_SPI_CTRLB) Receiver Enable Mask */
#define SERCOM_SPI_CTRLB_RXEN(value)          (SERCOM_SPI_CTRLB_RXEN_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLB_RXEN_Pos)) /* Assignment of value for RXEN in the SERCOM_SPI_CTRLB register */
#define SERCOM_SPI_CTRLB_Msk                  _UINT32_(0x0002E247)                                 /* (SERCOM_SPI_CTRLB) Register Mask  */


/* -------- SERCOM_USART_CTRLB : (SERCOM Offset: 0x04) (R/W 32) USART Control B -------- */
#define SERCOM_USART_CTRLB_RESETVALUE         _UINT32_(0x00)                                       /*  (SERCOM_USART_CTRLB) USART Control B  Reset Value */

#define SERCOM_USART_CTRLB_CHSIZE_Pos         _UINT32_(0)                                          /* (SERCOM_USART_CTRLB) Character Size Position */
#define SERCOM_USART_CTRLB_CHSIZE_Msk         (_UINT32_(0x7) << SERCOM_USART_CTRLB_CHSIZE_Pos)     /* (SERCOM_USART_CTRLB) Character Size Mask */
#define SERCOM_USART_CTRLB_CHSIZE(value)      (SERCOM_USART_CTRLB_CHSIZE_Msk & (_UINT32_(value) << SERCOM_USART_CTRLB_CHSIZE_Pos)) /* Assignment of value for CHSIZE in the SERCOM_USART_CTRLB register */
#define   SERCOM_USART_CTRLB_CHSIZE_8_BIT_Val _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLB) 8-bits character  */
#define   SERCOM_USART_CTRLB_CHSIZE_9_BIT_Val _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLB) 9-bits character  */
#define   SERCOM_USART_CTRLB_CHSIZE_5_BIT_Val _UINT32_(0x5)                                        /* (SERCOM_USART_CTRLB) 5-bits character  */
#define   SERCOM_USART_CTRLB_CHSIZE_6_BIT_Val _UINT32_(0x6)                                        /* (SERCOM_USART_CTRLB) 6-bits character  */
#define   SERCOM_USART_CTRLB_CHSIZE_7_BIT_Val _UINT32_(0x7)                                        /* (SERCOM_USART_CTRLB) 7-bits character  */
#define SERCOM_USART_CTRLB_CHSIZE_8_BIT       (SERCOM_USART_CTRLB_CHSIZE_8_BIT_Val << SERCOM_USART_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_CTRLB) 8-bits character Position */
#define SERCOM_USART_CTRLB_CHSIZE_9_BIT       (SERCOM_USART_CTRLB_CHSIZE_9_BIT_Val << SERCOM_USART_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_CTRLB) 9-bits character Position */
#define SERCOM_USART_CTRLB_CHSIZE_5_BIT       (SERCOM_USART_CTRLB_CHSIZE_5_BIT_Val << SERCOM_USART_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_CTRLB) 5-bits character Position */
#define SERCOM_USART_CTRLB_CHSIZE_6_BIT       (SERCOM_USART_CTRLB_CHSIZE_6_BIT_Val << SERCOM_USART_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_CTRLB) 6-bits character Position */
#define SERCOM_USART_CTRLB_CHSIZE_7_BIT       (SERCOM_USART_CTRLB_CHSIZE_7_BIT_Val << SERCOM_USART_CTRLB_CHSIZE_Pos) /* (SERCOM_USART_CTRLB) 7-bits character Position */
#define SERCOM_USART_CTRLB_SBMODE_Pos         _UINT32_(6)                                          /* (SERCOM_USART_CTRLB) Stop Bit Mode Position */
#define SERCOM_USART_CTRLB_SBMODE_Msk         (_UINT32_(0x1) << SERCOM_USART_CTRLB_SBMODE_Pos)     /* (SERCOM_USART_CTRLB) Stop Bit Mode Mask */
#define SERCOM_USART_CTRLB_SBMODE(value)      (SERCOM_USART_CTRLB_SBMODE_Msk & (_UINT32_(value) << SERCOM_USART_CTRLB_SBMODE_Pos)) /* Assignment of value for SBMODE in the SERCOM_USART_CTRLB register */
#define   SERCOM_USART_CTRLB_SBMODE_1_BIT_Val _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLB) One stop bit  */
#define   SERCOM_USART_CTRLB_SBMODE_2_BIT_Val _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLB) Two stop bits  */
#define SERCOM_USART_CTRLB_SBMODE_1_BIT       (SERCOM_USART_CTRLB_SBMODE_1_BIT_Val << SERCOM_USART_CTRLB_SBMODE_Pos) /* (SERCOM_USART_CTRLB) One stop bit Position */
#define SERCOM_USART_CTRLB_SBMODE_2_BIT       (SERCOM_USART_CTRLB_SBMODE_2_BIT_Val << SERCOM_USART_CTRLB_SBMODE_Pos) /* (SERCOM_USART_CTRLB) Two stop bits Position */
#define SERCOM_USART_CTRLB_COLDEN_Pos         _UINT32_(8)                                          /* (SERCOM_USART_CTRLB) Collision Detection Enable Position */
#define SERCOM_USART_CTRLB_COLDEN_Msk         (_UINT32_(0x1) << SERCOM_USART_CTRLB_COLDEN_Pos)     /* (SERCOM_USART_CTRLB) Collision Detection Enable Mask */
#define SERCOM_USART_CTRLB_COLDEN(value)      (SERCOM_USART_CTRLB_COLDEN_Msk & (_UINT32_(value) << SERCOM_USART_CTRLB_COLDEN_Pos)) /* Assignment of value for COLDEN in the SERCOM_USART_CTRLB register */
#define SERCOM_USART_CTRLB_SFDE_Pos           _UINT32_(9)                                          /* (SERCOM_USART_CTRLB) Start of Frame Detection Enable Position */
#define SERCOM_USART_CTRLB_SFDE_Msk           (_UINT32_(0x1) << SERCOM_USART_CTRLB_SFDE_Pos)       /* (SERCOM_USART_CTRLB) Start of Frame Detection Enable Mask */
#define SERCOM_USART_CTRLB_SFDE(value)        (SERCOM_USART_CTRLB_SFDE_Msk & (_UINT32_(value) << SERCOM_USART_CTRLB_SFDE_Pos)) /* Assignment of value for SFDE in the SERCOM_USART_CTRLB register */
#define SERCOM_USART_CTRLB_ENC_Pos            _UINT32_(10)                                         /* (SERCOM_USART_CTRLB) Encoding Format Position */
#define SERCOM_USART_CTRLB_ENC_Msk            (_UINT32_(0x1) << SERCOM_USART_CTRLB_ENC_Pos)        /* (SERCOM_USART_CTRLB) Encoding Format Mask */
#define SERCOM_USART_CTRLB_ENC(value)         (SERCOM_USART_CTRLB_ENC_Msk & (_UINT32_(value) << SERCOM_USART_CTRLB_ENC_Pos)) /* Assignment of value for ENC in the SERCOM_USART_CTRLB register */
#define   SERCOM_USART_CTRLB_ENC_IRDA_Val     _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLB) Data is IrDA encoded  */
#define SERCOM_USART_CTRLB_ENC_IRDA           (SERCOM_USART_CTRLB_ENC_IRDA_Val << SERCOM_USART_CTRLB_ENC_Pos) /* (SERCOM_USART_CTRLB) Data is IrDA encoded Position */
#define SERCOM_USART_CTRLB_PMODE_Pos          _UINT32_(13)                                         /* (SERCOM_USART_CTRLB) Parity Mode Position */
#define SERCOM_USART_CTRLB_PMODE_Msk          (_UINT32_(0x1) << SERCOM_USART_CTRLB_PMODE_Pos)      /* (SERCOM_USART_CTRLB) Parity Mode Mask */
#define SERCOM_USART_CTRLB_PMODE(value)       (SERCOM_USART_CTRLB_PMODE_Msk & (_UINT32_(value) << SERCOM_USART_CTRLB_PMODE_Pos)) /* Assignment of value for PMODE in the SERCOM_USART_CTRLB register */
#define   SERCOM_USART_CTRLB_PMODE_EVEN_Val   _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLB) Even parity  */
#define   SERCOM_USART_CTRLB_PMODE_ODD_Val    _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLB) Odd parity  */
#define SERCOM_USART_CTRLB_PMODE_EVEN         (SERCOM_USART_CTRLB_PMODE_EVEN_Val << SERCOM_USART_CTRLB_PMODE_Pos) /* (SERCOM_USART_CTRLB) Even parity Position */
#define SERCOM_USART_CTRLB_PMODE_ODD          (SERCOM_USART_CTRLB_PMODE_ODD_Val << SERCOM_USART_CTRLB_PMODE_Pos) /* (SERCOM_USART_CTRLB) Odd parity Position */
#define SERCOM_USART_CTRLB_TXEN_Pos           _UINT32_(16)                                         /* (SERCOM_USART_CTRLB) Transmitter Enable Position */
#define SERCOM_USART_CTRLB_TXEN_Msk           (_UINT32_(0x1) << SERCOM_USART_CTRLB_TXEN_Pos)       /* (SERCOM_USART_CTRLB) Transmitter Enable Mask */
#define SERCOM_USART_CTRLB_TXEN(value)        (SERCOM_USART_CTRLB_TXEN_Msk & (_UINT32_(value) << SERCOM_USART_CTRLB_TXEN_Pos)) /* Assignment of value for TXEN in the SERCOM_USART_CTRLB register */
#define SERCOM_USART_CTRLB_RXEN_Pos           _UINT32_(17)                                         /* (SERCOM_USART_CTRLB) Receiver Enable Position */
#define SERCOM_USART_CTRLB_RXEN_Msk           (_UINT32_(0x1) << SERCOM_USART_CTRLB_RXEN_Pos)       /* (SERCOM_USART_CTRLB) Receiver Enable Mask */
#define SERCOM_USART_CTRLB_RXEN(value)        (SERCOM_USART_CTRLB_RXEN_Msk & (_UINT32_(value) << SERCOM_USART_CTRLB_RXEN_Pos)) /* Assignment of value for RXEN in the SERCOM_USART_CTRLB register */
#define SERCOM_USART_CTRLB_LINCMD_Pos         _UINT32_(24)                                         /* (SERCOM_USART_CTRLB) LIN Command Position */
#define SERCOM_USART_CTRLB_LINCMD_Msk         (_UINT32_(0x3) << SERCOM_USART_CTRLB_LINCMD_Pos)     /* (SERCOM_USART_CTRLB) LIN Command Mask */
#define SERCOM_USART_CTRLB_LINCMD(value)      (SERCOM_USART_CTRLB_LINCMD_Msk & (_UINT32_(value) << SERCOM_USART_CTRLB_LINCMD_Pos)) /* Assignment of value for LINCMD in the SERCOM_USART_CTRLB register */
#define   SERCOM_USART_CTRLB_LINCMD_NONE_Val  _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLB) Normal USART transmission  */
#define   SERCOM_USART_CTRLB_LINCMD_SOFTWARE_CONTROL_TRANSMIT_CMD_Val _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLB) A break field is transmitted when DATA is written  */
#define   SERCOM_USART_CTRLB_LINCMD_AUTO_TRANSMIT_CMD_Val _UINT32_(0x2)                                        /* (SERCOM_USART_CTRLB) The break, sync, and identifier fields are automatically transmitted when the DATA is written with the identifier  */
#define SERCOM_USART_CTRLB_LINCMD_NONE        (SERCOM_USART_CTRLB_LINCMD_NONE_Val << SERCOM_USART_CTRLB_LINCMD_Pos) /* (SERCOM_USART_CTRLB) Normal USART transmission Position */
#define SERCOM_USART_CTRLB_LINCMD_SOFTWARE_CONTROL_TRANSMIT_CMD (SERCOM_USART_CTRLB_LINCMD_SOFTWARE_CONTROL_TRANSMIT_CMD_Val << SERCOM_USART_CTRLB_LINCMD_Pos) /* (SERCOM_USART_CTRLB) A break field is transmitted when DATA is written Position */
#define SERCOM_USART_CTRLB_LINCMD_AUTO_TRANSMIT_CMD (SERCOM_USART_CTRLB_LINCMD_AUTO_TRANSMIT_CMD_Val << SERCOM_USART_CTRLB_LINCMD_Pos) /* (SERCOM_USART_CTRLB) The break, sync, and identifier fields are automatically transmitted when the DATA is written with the identifier Position */
#define SERCOM_USART_CTRLB_Msk                _UINT32_(0x03032747)                                 /* (SERCOM_USART_CTRLB) Register Mask  */


